app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "ahayh"], ["body", "yzuea5hh8jkosu5wbxrs"], ["created_at", "2026-04-11 07:10:16.564047"], ["updated_at", "2026-04-11 07:10:16.564047"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
    flash[:notice] = "Book was successfully created!"
    redirect_to book_path(@book.id)
    else
    @books = Book.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "ngyix"], ["body", "pj4zxx1tm0dmcctwyzoi"], ["updated_at", "2026-04-11 07:10:16.794257"], ["id", 1]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)