app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES ('てすと', 'てすと', '2026-04-11 01:25:17.122356', '2026-04-11 01:25:17.122356') RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = 20 LIMIT 1
---
  def show
    @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = 20 LIMIT 1
---
  def edit
    @book = Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = 20 LIMIT 1
UPDATE "books" SET "body" = 'い', "updated_at" = '2026-04-11 06:48:43.715484' WHERE "books"."id" = 24
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = 24 LIMIT 1
DELETE FROM "books" WHERE "books"."id" = 24
---
  def destroy
    book = Book.find(params[:id])
    book.destroy